---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DirectShape..::..AddReferencePoint Method
DirectShape Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AddReferencePoint(XYZ) | Adds a reference point to the DirectShape. |
|  | AddReferencePoint(XYZ, DirectShapeReferenceOptions) | Adds a reference point to the DirectShape. |

# See Also

DirectShape Class

DirectShape Members

Autodesk.Revit.DB Namespace